tutorials/cht-cem-coupling/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (CEM CHT);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh-Centers;
    locations         faceCenters;
    connectivity      false;
    patches           (bottom);
    
    readData
    (
      ElectricFlux
      Heat-Flux
    );
    
    writeData
    (
    );
  };
  
  Interface2
  {
    mesh              Fluid-Mesh-Nodes;
    locations         faceNodes;
    connectivity      true;
    patches           (bottom);
    
    readData
    (
    );
    
    writeData
    (
      Potential
      Temperature
    );
  };
};

CHT
{
   k   [ 1  1 -3 -1 0 0 0 ] 100;
   solverType "basic";
};
